archive/before-2018-11-10/2017-06-26-python中神奇的下划线.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2017-06-26-python中神奇的下划线</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2017-06-26-python中神奇的下划线</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org392048a">1. 存储解释器上一次执行的结果</a></li>
<li><a href="#org744d228">2. 忽略一些特殊的值</a></li>
<li><a href="#orgd0a66b5">3. 给变量或者函数以特殊地意义</a>
<ul>
<li><a href="#org75c8f9f">3.1. 以一个下划线开头</a></li>
<li><a href="#orgdc1ced0">3.2. 以一个下划线结尾</a></li>
<li><a href="#orgaefa050">3.3. 以两个下划线开头</a></li>
<li><a href="#org74c3554">3.4. 以两个下划线开头和结尾</a></li>
</ul>
</li>
<li><a href="#orge215d8c">4. 做为国际化、本地化的功能</a></li>
<li><a href="#org6ae09d7">5. 分隔字面值的数字</a></li>
</ul>
</div>
</div>
<p>
下划线 <code>_</code> 在python中有一些特殊地用法。我觉得 <a href="https://hackernoon.com/understanding-the-underscore-of-python-309d1a029edc">这篇文章</a> 总结得很好了。
基本上我是把它翻译了一下。就算是做笔记了。下划线在python中的使用，可能
是一些约定，也可能是语法要求。主要分为下面5种。
</p>


<p>
There are 5 cases for using the underscore in Python.
</p>
<ol class="org-ol">
<li>For storing the value of last expression in interpreter.</li>
<li>For ignoring the specific values. (so-called “I don’t care”)</li>
<li>To give special meanings and functions to name of vartiables or
functions.</li>
<li>To use as ‘Internationalization(i18n)’ or ‘Localization(l10n)’
functions.</li>
<li>To separate the digits of number literal value.</li>
</ol>


<div id="outline-container-org392048a" class="outline-2">
<h2 id="org392048a"><span class="section-number-2">1</span> 存储解释器上一次执行的结果</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
    &gt;&gt;&gt; 10 
    10 
    &gt;&gt;&gt; _ 
    10 
    &gt;&gt;&gt; _ * 3 
    30 
    &gt;&gt;&gt; _ * 20 
    600
</pre>
</div>
</div>

<div id="outline-container-org744d228" class="outline-2">
<h2 id="org744d228"><span class="section-number-2">2</span> 忽略一些特殊的值</h2>
<div class="outline-text-2" id="text-2">
<p>
可能用户并不care这些特殊值或这些值就没有使用，就把它赋给下划线啦：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Ignore a value when unpacking</span>
    <span style="color: #ff8700;">x</span>, <span style="color: #ff8700;">_</span>, <span style="color: #ff8700;">y</span> = (1, 2, 3) <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">x = 1, y = 3 </span>

    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Ignore the multiple values. It is called "Extended Unpacking" which</span>
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">is available in only Python 3.x</span>
    x, *<span style="color: #ff8700;">_</span>, <span style="color: #ff8700;">y</span> = (1, 2, 3, 4, 5) <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">x = 1, y = 5</span>

    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Ignore the index</span>
    <span style="color: #a1db00;">for</span> _ <span style="color: #a1db00;">in</span> <span style="color: #d18aff;">range</span>(10):     
        do_something()

    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Ignore a value of specific location</span>
    <span style="color: #a1db00;">for</span> _, val <span style="color: #a1db00;">in</span> list_of_tuple:
        do_something()

    <span style="color: #a1db00;">for</span> root, _, files <span style="color: #a1db00;">in</span> os.walk():
        do_something()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0a66b5" class="outline-2">
<h2 id="orgd0a66b5"><span class="section-number-2">3</span> 给变量或者函数以特殊地意义</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org75c8f9f" class="outline-3">
<h3 id="org75c8f9f"><span class="section-number-3">3.1</span> 以一个下划线开头</h3>
<div class="outline-text-3" id="text-3-1">
<p>
只是防止模块的属性用 <code>from mymodule import *</code> 来加载。对比上面的例
子：
如果 <code>test.py</code> 长这样：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">_internal_name</span> = <span style="color: #ff4ea3;">'one_nodule'</span> <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">private variable</span>
    <span style="color: #ff8700;">_internal_version</span> = <span style="color: #ff4ea3;">'1.0'</span> <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">private variable</span>

    <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">_Base</span>: <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">private class</span>
        <span style="color: #ff8700;">_hidden_factor</span> = 2 <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">private variable</span>
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, price):
            <span style="color: #a1db00;">self</span>._price = price
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">_double_price</span>(<span style="color: #a1db00;">self</span>): <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">private method</span>
            <span style="color: #a1db00;">return</span> <span style="color: #a1db00;">self</span>._price * <span style="color: #a1db00;">self</span>._hidden_factor
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">get_double_price</span>(<span style="color: #a1db00;">self</span>):
            <span style="color: #a1db00;">return</span> <span style="color: #a1db00;">self</span>._double_price() 
</pre>
</div>
<p>
那在其他python文件中这样引用是使用不了的啦：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> test1 <span style="color: #a1db00;">import</span> *
    <span style="color: #a1db00;">print</span> _internal_name
</pre>
</div>
<p>
但是可以显式地指定，所以python中的“私有”只是相对的：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> test1 <span style="color: #a1db00;">import</span> _internal_name
    <span style="color: #a1db00;">print</span> _internal_name
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc1ced0" class="outline-3">
<h3 id="orgdc1ced0"><span class="section-number-3">3.2</span> 以一个下划线结尾</h3>
<div class="outline-text-3" id="text-3-2">
<p>
一般是避免和python中的内置名称冲突：
</p>
<div class="org-src-container">
<pre class="src src-python">     Tkinter.Toplevel(master, class_=<span style="color: #ff4ea3;">'ClassName'</span>) <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Avoid conflict with 'class' keyword</span>
     <span style="color: #ff8700;">list_</span> = List.objects.get(1) <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Avoid conflict with 'list' built-in type</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaefa050" class="outline-3">
<h3 id="orgaefa050"><span class="section-number-3">3.3</span> 以两个下划线开头</h3>
<div class="outline-text-3" id="text-3-3">
<p>
这是下划线为数不多地做为语法使用的情况：
</p>

<p>
该属性在运行时被混淆。如下代码：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/usr/local/bin/python</span>

    <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">RandSeq</span>(<span style="color: #d18aff;">object</span>):
        <span style="color: #ff4b4b;">"""Documentation for RandSeq</span>

<span style="color: #ff4b4b;">        """</span>
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, seq):
            <span style="color: #d18aff;">super</span>(RandSeq, <span style="color: #a1db00;">self</span>).__init__()
            <span style="color: #a1db00;">self</span>.__data = seq

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__nonzero__</span>(<span style="color: #a1db00;">self</span>):
            <span style="color: #a1db00;">return</span> <span style="color: #5fafd7;">False</span>

    <span style="color: #ff8700;">r</span> = RandSeq(12)
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">print r.__data</span>
    <span style="color: #a1db00;">print</span> r._RandSeq__data
</pre>
</div>
<p>
直接访问 <code>__data</code> 是不行的。但是可以使用 <code>_RandSeq__data</code> 来访问。
也就是说以 <code>__</code> 开头的属性，不是不能访问了。而是在运行时在前面加上
了 <code>_Classname</code> 。这样父类子类的以 <code>__</code> 开头的属性在运行时看起来好
像就是自己“私有”的了。
</p>
</div>
</div>

<div id="outline-container-org74c3554" class="outline-3">
<h3 id="org74c3554"><span class="section-number-3">3.4</span> 以两个下划线开头和结尾</h3>
<div class="outline-text-3" id="text-3-4">
<p>
一般是一些特殊地（也称为“魔法函数”）的方法，比如 <code>__init__(),
   __len()</code> 。它们提供特殊的写法，当然也做特殊的事情啦。一般不要重写它
们。
</p>
</div>
</div>
</div>

<div id="outline-container-orge215d8c" class="outline-2">
<h2 id="orge215d8c"><span class="section-number-2">4</span> 做为国际化、本地化的功能</h2>
<div class="outline-text-2" id="text-4">
<p>
比如 <code>gettext</code> ：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">see official docs : https://docs.python.org/3/library/gettext.html</span>
    <span style="color: #a1db00;">import</span> gettext
    gettext.bindtextdomain(<span style="color: #ff4ea3;">'myapplication'</span>,<span style="color: #ff4ea3;">'/path/to/my/language/directory'</span>)
    gettext.textdomain(<span style="color: #ff4ea3;">'myapplication'</span>)
    <span style="color: #ff8700;">_</span> = gettext.gettext
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">...</span>
    <span style="color: #a1db00;">print</span>(_(<span style="color: #ff4ea3;">'This is a translatable string.'</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ae09d7" class="outline-2">
<h2 id="org6ae09d7"><span class="section-number-2">5</span> 分隔字面值的数字</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>注意 这是 <code>python 3.6</code> 的新功能。</b> 
</p>

<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">dec_base</span> = 1_000_000
    <span style="color: #ff8700;">bin_base</span> = 0b_1111_0000
    <span style="color: #ff8700;">hex_base</span> = 0x_1234_abcd
    <span style="color: #a1db00;">print</span>(dec_base) <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">1000000</span>
    <span style="color: #a1db00;">print</span>(bin_base) <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">240</span>
    <span style="color: #a1db00;">print</span>(hex_base) <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">305441741</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>